demo-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>lispy.el demo 1: practice generating code</title>
<!-- 2014-11-27 Thu 10:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Oleh" />
<link rel="stylesheet" type="text/css" href="demo-style.css"/>
</head>
<body>
<div id="preamble" class="status">
<link rel="icon" type="image/x-icon" href="https://github.com/favicon.ico"/>
</div>
<div id="content">
<h1 class="title">lispy.el demo 1: practice generating code</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><a href="https://github.com/abo-abo/lispy">Back to github</a></td>
<td class="left"><a href="https://raw.githubusercontent.com/abo-abo/lispy/gh-pages/demo-1.org">This file in org-mode</a></td>
<td class="left"><a href="http://abo-abo.github.io/lispy/">Function reference</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Intro</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Comes from <a href="http://emacs.stackexchange.com/questions/3881/changing-the-role-of-the-underline-and-the-minus-sign-just-in-latex-mode">this emacs.stackexchange question</a>.
</p>
</div>
</div>
<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Task summary</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
For <code>LaTeX-mode</code>, swap <kbd>-</kbd> to <kbd>_</kbd>, and swap <kbd>6</kbd> to <kbd>^</kbd>.
</p>
</div>
</div>
<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Screencast</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
The screencast for this demo is here: <a href="https://www.youtube.com/watch?v=2w1h48CYOMo">https://www.youtube.com/watch?v=2w1h48CYOMo</a>
</p>
</div>
</div>
<div id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">Resulting code</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key LaTeX-mode-map <span style="color: #2A00FF;">"_"</span> (<span style="color: #7F0055; font-weight: bold;">lambda</span> () (interactive) (insert <span style="color: #2A00FF;">"-"</span>)))
(define-key LaTeX-mode-map <span style="color: #2A00FF;">"-"</span> (<span style="color: #7F0055; font-weight: bold;">lambda</span> () (interactive) (insert <span style="color: #2A00FF;">"_"</span>)))
(define-key LaTeX-mode-map <span style="color: #2A00FF;">"^"</span> (<span style="color: #7F0055; font-weight: bold;">lambda</span> () (interactive) (insert <span style="color: #2A00FF;">"6"</span>)))
(define-key LaTeX-mode-map <span style="color: #2A00FF;">"6"</span> (<span style="color: #7F0055; font-weight: bold;">lambda</span> () (interactive) (insert <span style="color: #2A00FF;">"^"</span>)))
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-5" class="outline-2">
<h2 id="unnumbered-5">How to generate this code:</h2>
<div class="outline-text-2" id="text-unnumbered-5">
</div><div id="outline-container-unnumbered-6" class="outline-3">
<h3 id="unnumbered-6">step one</h3>
<div class="outline-text-3" id="text-unnumbered-6">
<p>
Write:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #2A00FF;">"-"</span> <span style="color: #2A00FF;">"_"</span>
<span style="color: #2A00FF;">"6"</span> <span style="color: #2A00FF;">"^"</span>
</pre>
</div>
<ul class="org-ul">
<li>position the point at the start
</li>
<li><kbd>C-7</kbd> to add one cursor
</li>
<li><kbd>M-m</kbd> to mark the first string
</li>
<li><kbd>&gt;</kbd> to extend the region to the second string
</li>
<li><kbd>c</kbd> to clone region
</li>
<li><kbd>i</kbd> to select the first element of the region
</li>
<li><kbd>s</kbd> to move the region down
</li>
<li><kbd>C-7</kbd> to cancel <code>multiple-cursors</code>.
</li>
</ul>
<p>
You should now have:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #2A00FF;">"_"</span> <span style="color: #2A00FF;">"-"</span>
<span style="color: #2A00FF;">"-"</span> <span style="color: #2A00FF;">"_"</span>
<span style="color: #2A00FF;">"^"</span> <span style="color: #2A00FF;">"6"</span>
<span style="color: #2A00FF;">"6"</span> <span style="color: #2A00FF;">"^"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-7" class="outline-3">
<h3 id="unnumbered-7">step two</h3>
<div class="outline-text-3" id="text-unnumbered-7">
<p>
Write:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(define-key LaTeX-mode-map (<span style="color: #7F0055; font-weight: bold;">lambda</span> () (interactive) (insert)))
</pre>
</div>
<p>
Kill it with <kbd>C-,</kbd> or <kbd>C-k</kbd>.
</p>
</div>
</div>
<div id="outline-container-unnumbered-8" class="outline-3">
<h3 id="unnumbered-8">step three</h3>
<div class="outline-text-3" id="text-unnumbered-8">
<ul class="org-ul">
<li>position the point at the start
</li>
<li><kbd>M-3 C-7</kbd> to add three cursors
</li>
<li><kbd>C-y</kbd> to paste the code from before
</li>
<li>add one space
</li>
<li><kbd>M-m</kbd> mark
</li>
<li><kbd>&gt;</kbd> grow
</li>
<li><kbd>ok</kbd> insert up
</li>
<li><kbd>iw</kbd> select first and move up
</li>
<li><kbd>jj</kbd> go down twice
</li>
<li><kbd>okok</kbd> insert up twice
</li>
<li><kbd>C-7</kbd> to cancel <code>multiple-cursors</code>
</li>
</ul>

<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
</div>
</div>
</div>
</div>
</body>
</html>
